//-------------------------------------------------------------------------------------------------
//  -- 版权所有者   : 中国大恒（集团）有限公司北京图像视觉技术分公司, 2010 -2015.
//  -- 保密级别     ：绝密.
//  -- 部门         : 硬件部，FPGA工作组
//  -- 模块名       : wrap_frame_buf_traffic
//  -- 设计者       : 邢海涛
//-------------------------------------------------------------------------------------------------
//
//  -- 版本记录 :
//
//  -- 作者         :| 修改日期				:|  修改说明
//-------------------------------------------------------------------------------------------------
//  -- 邢海涛       :| 2014/6/10 11:03:31	:|  初始版本
//-------------------------------------------------------------------------------------------------
//
//  -- 模块描述     :
//              1)  : ... ...
//
//              2)  : ... ...
//
//              3)  : ... ...
//
//-------------------------------------------------------------------------------------------------
//`include			"wrap_frame_buf_traffic_def.v"
//仿真单位/精度
`timescale 1ns/1ps
//-------------------------------------------------------------------------------------------------

module wrap_frame_buf_traffic (
	input			clk		,
	input			reset	,
	input			i_fval	,
	input			i_dval	,
	input	[22:0]	iv_frame_size	,
	output	[31:0]	ov_image_dout	,

	input			i_buf_empty	,
	output			o_buf_rd	,
	input	[32:0]	iv_image_din	,
	output			o_good_frame	,
	output			o_bad_frame
	
);

//	ref signals



//	ref ARCHITECTURE

	//  -------------------------------------------------------------------------------------
	//	数据产生逻辑
	//  -------------------------------------------------------------------------------------
	wrap_wr_data wrap_wr_data_inst (
	.clk			(clk			),
	.reset			(reset			),
	.i_fval			(i_fval			),
	.i_dval			(i_dval			),
	.iv_frame_size	(iv_frame_size	),
	.ov_image_dout	(ov_image_dout	)
	);

	//  -------------------------------------------------------------------------------------
	//	读帧缓存数据的模块
	//  -------------------------------------------------------------------------------------
	wrap_rd_data wrap_rd_data_inst (
	.clk			(clk		),
	.reset			(reset		),
	.i_buf_empty	(i_buf_empty	),
	.o_buf_rd		(o_buf_rd		),
	.iv_frame_size	(iv_frame_size	),
	.iv_image_din	(iv_image_din	),
	.o_good_frame	(o_good_frame	),
	.o_bad_frame	(o_bad_frame	)
	);



endmodule
