//-------------------------------------------------------------------------------------------------
//  -- 版权所有者   : 中国大恒（集团）有限公司北京图像视觉技术分公司, 2010 -2015.
//  -- 保密级别     ：绝密.
//  -- 部门         : 硬件部，FPGA工作组
//  -- 模块名       : chk_flhide
//  -- 设计者       : 邢海涛
//-------------------------------------------------------------------------------------------------
//
//  -- 版本记录 :
//
//  -- 作者         :| 修改日期				:|  修改说明
//-------------------------------------------------------------------------------------------------
//  -- 邢海涛       :| 2015/4/27 13:52:31	:|  初始版本
//-------------------------------------------------------------------------------------------------
//
//  -- 模块描述     :
//              1)  : ... ...
//
//              2)  : ... ...
//
//              3)  : ... ...
//
//-------------------------------------------------------------------------------------------------
//仿真单位/精度
`timescale 1ns/1ps
//-------------------------------------------------------------------------------------------------

module chk_flhide # (
	parameter	DATA_WIDTH		= 8		,	//数据位宽
	parameter	CHANNEL_NUM		= 4		,	//通道数
	parameter	STOP_ON_ERROR	= 1			//出现错误时是否停止
	)
	(
	input										clk			,	//时钟
	input										i_fval		,	//场有效
	input										i_lval		,	//行有效
	input	[DATA_WIDTH*CHANNEL_NUM-1:0]		iv_pix_data		//行有效
	);

	//	ref signals


	//	ref ARCHITECTURE

	//	-------------------------------------------------------------------------------------
	//	监视fval=0时的其他输出
	//  -------------------------------------------------------------------------------------
	always @ (posedge clk) begin
		if(!i_fval) begin
			if(i_lval==1'b1 || iv_pix_data!={(DATA_WIDTH*CHANNEL_NUM){1'b0}}) begin
				$display("%m: at time %t ERROR: when fval=0,lval pix_data not 0", $time);
				if(STOP_ON_ERROR==1) begin
					$stop;
				end
			end
		end
	end

	//	-------------------------------------------------------------------------------------
	//	监视fval=0时的其他输出
	//  -------------------------------------------------------------------------------------
	always @ (posedge clk) begin
		if(!i_lval) begin
			if(iv_pix_data!={(DATA_WIDTH*CHANNEL_NUM){1'b0}}) begin
				$display("%m: at time %t ERROR: when lval=0,pix_data not 0", $time);
				if(STOP_ON_ERROR==1) begin
					$stop;
				end
			end
		end
	end

endmodule
