//-------------------------------------------------------------------------------------------------
//  -- 版权所有者   : 中国大恒（集团）有限公司北京图像视觉技术分公司, 2010 -2015.
//  -- 保密级别     ：绝密.
//  -- 部门         : 硬件部，FPGA工作组
//  -- 模块名       : rd_back_buf
//  -- 设计者       : 邢海涛
//-------------------------------------------------------------------------------------------------
//
//  -- 版本记录 :
//
//  -- 作者         :| 修改日期				:|  修改说明
//-------------------------------------------------------------------------------------------------
//  -- 邢海涛       :| 2015/4/2 10:04:30	:|  初始版本
//-------------------------------------------------------------------------------------------------
//
//  -- 模块描述     :
//              1)  : ... ...
//
//              2)  : ... ...
//
//              3)  : ... ...
//
//-------------------------------------------------------------------------------------------------
//仿真单位/精度
`timescale 1ns/1ps
//-------------------------------------------------------------------------------------------------

module rd_back_buf # (
	parameter	DATA_WIDTH	= 8		//数据位宽
	)
	(
	input						clk			,
	input						i_empty		,
	input	[DATA_WIDTH:0]		iv_pix_data	,
	output						o_rd		,
	output						o_fval		,
	output						o_lval		,
	output	[DATA_WIDTH-1:0]	ov_pix_data
	);

	//	ref signals


	//	ref ARCHITECTURE
	assign	o_rd		= !i_empty;
	assign	o_fval		= iv_pix_data[DATA_WIDTH];
	assign	o_lval		= o_fval&o_rd;
	assign	ov_pix_data	= iv_pix_data[DATA_WIDTH-1:0];
	


endmodule
