//-------------------------------------------------------------------------------------------------
//  -- 版权所有者   : 中国大恒（集团）有限公司北京图像视觉技术分公司, 2010 -2015.
//  -- 保密级别     ：绝密.
//  -- 部门         : 硬件部，FPGA工作组
//  -- 模块名       : dcm100
//  -- 设计者       : 邢海涛
//-------------------------------------------------------------------------------------------------
//
//  -- 版本记录 :
//
//  -- 作者         :| 修改日期				:|  修改说明
//-------------------------------------------------------------------------------------------------
//  -- 邢海涛       :| 2015/2/28 13:11:28	:|  初始版本
//-------------------------------------------------------------------------------------------------
//
//  -- 模块描述     :
//              1)  : ... ...
//
//              2)  : ... ...
//
//              3)  : ... ...
//
//-------------------------------------------------------------------------------------------------
//仿真单位/精度
`timescale 1ns/1ps
//-------------------------------------------------------------------------------------------------

module dcm100 (
	input         clk_in		,	//时钟输入
	input         dcm_reset		,	//DCM复位，高有效
	output        clk_fx_out	,	//clkfx输出
	output        locked			//DCM锁定，高有效
	);

	//	ref signals
	wire 		[7:0]  	status_int		;
	wire 				clkfb			;
	wire 				clk0			;
	wire 				clkfx			;

	//	ref ARCHITECTURE

	//  -------------------------------------------------------------------------------------
	//	dcm 例化
	//  -------------------------------------------------------------------------------------
	DCM_SP # (
	.CLKDV_DIVIDE          (2.000				),
	.CLKFX_DIVIDE          (2					),
	.CLKFX_MULTIPLY        (5					),
	.CLKIN_DIVIDE_BY_2     ("FALSE"				),
	.CLKIN_PERIOD          (25.0				),
	.CLKOUT_PHASE_SHIFT    ("NONE"				),
	.CLK_FEEDBACK          ("1X"				),
	.DESKEW_ADJUST         ("SYSTEM_SYNCHRONOUS"),
	.PHASE_SHIFT           (0					),
	.STARTUP_WAIT          ("FALSE"				)
	)
	dcm_sp_inst (
	// Input clocks
	.CLKIN                 (clk_in		),
	.CLKFB                 (clkfb		),
	// Output clocks
	.CLK0                  (clk0		),
	.CLK90                 (			),
	.CLK180                (			),
	.CLK270                (			),
	.CLK2X                 (			),
	.CLK2X180              (			),
	.CLKFX                 (clkfx		),
	.CLKFX180              (			),
	.CLKDV                 (			),
	// Ports for dynamic phase shift
	.PSCLK                 (1'b0		),
	.PSEN                  (1'b0		),
	.PSINCDEC              (1'b0		),
	.PSDONE                (			),
	// Other control and status signals
	.LOCKED                (locked		),
	.STATUS                (status_int	),
	.RST                   (dcm_reset	),
	// Unused pin- tie low
	.DSSEN                 (1'b0		)
	);



	//  -------------------------------------------------------------------------------------
	//	clk0全局驱动
	//  -------------------------------------------------------------------------------------
	BUFG clk0_buf (
	.I		(clk0	),
	.O		(clkfb	)
	);

	//  -------------------------------------------------------------------------------------
	//	clkfx全局驱动
	//  -------------------------------------------------------------------------------------
	BUFGCE clkfx_buf (
	.I		(clkfx		),
	.CE		(locked		),
	.O		(clk_fx_out	)
	);




endmodule
