//-------------------------------------------------------------------------------------------------
//  -- 版权所有者   : 中国大恒（集团）有限公司北京图像视觉技术分公司, 2010 -2015.
//  -- 保密级别     ：绝密.
//  -- 部门         : 硬件部，FPGA工作组
//  -- 模块名       : ccd_sharp_vshift
//  -- 设计者       : 邢海涛
//-------------------------------------------------------------------------------------------------
//
//  -- 版本记录 :
//
//  -- 作者         :| 修改日期				:|  修改说明
//-------------------------------------------------------------------------------------------------
//  -- 邢海涛       :| 2015/8/10 14:14:50	:|  初始版本
//-------------------------------------------------------------------------------------------------
//
//  -- 模块描述     :
//              1)  : ... ...
//
//              2)  : ... ...
//
//              3)  : ... ...
//
//-------------------------------------------------------------------------------------------------
//仿真单位/精度
`timescale 1ns/1ps
//-------------------------------------------------------------------------------------------------

module ccd_sharp_vshift (
	input			xv1				,	//垂直驱动
	input			xv2				,	//垂直驱动
	input			xv3				,	//垂直驱动
	input			xv4				,	//垂直驱动
	input			xsg				,	//曝光结束信号
	output			o_line_change	,	//垂直翻转结束
	output			o_frame_change		//曝光结束信号
	);

	//	ref signals
	wire	[3:0]		xv_comb		;
	reg					line_change		= 1'b0;
	reg					frame_change	= 1'b0;

	//	ref ARCHITECTURE

	//	-------------------------------------------------------------------------------------
	//	垂直翻转
	//	-------------------------------------------------------------------------------------
	assign	xv_comb	= {xv4,xv3,xv2,xv1};

	initial begin
		forever begin
			line_change	= 1'b0;
			wait(xv_comb==4'b0011);
			wait(xv_comb==4'b0111);
			wait(xv_comb==4'b0110);
			wait(xv_comb==4'b1110);
			wait(xv_comb==4'b1100);
			wait(xv_comb==4'b1101);
			wait(xv_comb==4'b1001);
			wait(xv_comb==4'b1011);
			wait(xv_comb==4'b0011);
			#10
			line_change	= 1'b1;
			#10
			line_change	= 1'b0;
		end
	end
	assign	o_line_change	= line_change;

	//	-------------------------------------------------------------------------------------
	//	曝光
	//	-------------------------------------------------------------------------------------
	initial begin
		forever begin
			frame_change	= 1'b0;
			@(negedge xsg)
			#10
			frame_change	= 1'b1;
			#10
			frame_change	= 1'b0;
		end
	end
	assign	o_frame_change	= frame_change;


endmodule
