//-------------------------------------------------------------------------------------------------
//  -- 版权所有者   : 中国大恒（集团）有限公司北京图像视觉技术分公司, 2010 -2015.
//  -- 保密级别     ：绝密.
//  -- 部门         : 硬件部，FPGA工作组
//  -- 模块名       : cs_top
//  -- 设计者       : 邢海涛
//-------------------------------------------------------------------------------------------------
//
//  -- 版本记录 :
//
//  -- 作者         :| 修改日期				:|  修改说明
//-------------------------------------------------------------------------------------------------
//  -- 邢海涛       :| 2014/6/5 14:45:18	:|  初始版本
//-------------------------------------------------------------------------------------------------
//
//  -- 模块描述     :
//              1)  : ... ...
//
//              2)  : ... ...
//
//              3)  : ... ...
//
//-------------------------------------------------------------------------------------------------
//`include			"cs_top_def.v"
//仿真单位/精度
`timescale 1ns/1ps
//-------------------------------------------------------------------------------------------------

module cs_top (
	input			CLK			,
	input	[119:0]	TRIG0		,
	input	[31:0]	ASYNC_IN	,
	output	[31:0]	ASYNC_OUT
	);

	//	ref signals

	wire	[35:0]	CONTROL0;
	wire	[35:0]	CONTROL1;

	//	ref ARCHITECTURE

	chipscope_icon chipscope_icon_inst (
	.CONTROL0	(CONTROL0	),
	.CONTROL1	(CONTROL1	)
	);

	chipscope_ila chipscope_ila_inst (
	.CONTROL	(CONTROL0	),
	.CLK		(CLK		),
	.TRIG0		(TRIG0		)
	);

	chipscope_vio chipscope_vio_inst (
	.CONTROL	(CONTROL1	),
	.ASYNC_IN	(ASYNC_IN	),
	.ASYNC_OUT	(ASYNC_OUT	)
	);




endmodule
