//-------------------------------------------------------------------------------------------------
//  -- 版权所有者   : 中国大恒（集团）有限公司北京图像视觉技术分公司, 2010 -2015.
//  -- 保密级别     ：绝密.
//  -- 部门         : 硬件部，FPGA工作组
//  -- 模块名       : dcm_pix
//  -- 设计者       : 邢海涛
//-------------------------------------------------------------------------------------------------
//
//  -- 版本记录 :
//
//  -- 作者         :| 修改日期				:|  修改说明
//-------------------------------------------------------------------------------------------------
//  -- 邢海涛       :| 2015/2/28 13:11:28	:|  初始版本
//  -- 张  强       :| 2015/12/21 14:40:20	:|  mer_230_060u3x输出36MHz时钟
//-------------------------------------------------------------------------------------------------
//
//  -- 模块描述     :
//              1)  : ... ...
//
//              2)  : ... ...
//
//              3)  : ... ...
//
//-------------------------------------------------------------------------------------------------
//仿真单位/精度
`timescale 1ns/1ps
//-------------------------------------------------------------------------------------------------

module dcm_pix (
	input         clk_in		,	//时钟输入
	input         dcm_reset		,	//DCM复位，高有效
	output        clk_fx_out	,	//clkfx输出
	output        clk_fxdv_out	,	//clkfx输出
	output        locked			//DCM锁定，高有效
	);

	//	ref signals
	wire 				clkfx			;
	wire 				clkfxdv			;

	//	ref ARCHITECTURE

	//  -------------------------------------------------------------------------------------
	//	dcm 例化
	//  -------------------------------------------------------------------------------------
	DCM_CLKGEN # (
	.CLKFXDV_DIVIDE        (2				),
	.CLKFX_DIVIDE          (4				),
	.CLKFX_MULTIPLY        (11				),
	.SPREAD_SPECTRUM       ("NONE"			),
	.STARTUP_WAIT          ("FALSE"			),
	.CLKIN_PERIOD          (25.000			),
	.CLKFX_MD_MAX          (0.000			)
	)
	DCM_CLKGEN_inst (
	// Input clock
	.CLKIN                 (clk_in			),
	// Output clocks
	.CLKFX                 (clkfx			),
	.CLKFX180              (				),
	.CLKFXDV               (clkfxdv			),
	// Ports for dynamic reconfiguration
	.PROGCLK               (1'b0			),
	.PROGDATA              (1'b0			),
	.PROGEN                (1'b0			),
	.PROGDONE              (				),
	// Other control and status signals
	.FREEZEDCM             (1'b0			),
	.LOCKED                (locked			),
	.STATUS                (				),
	.RST                   (dcm_reset		)
	);

	//  -------------------------------------------------------------------------------------
	//	clkfx全局驱动
	//  -------------------------------------------------------------------------------------
	BUFGCE clkfx_buf (
	.I						(clkfx			),
	.CE						(locked			),
	.O						(clk_fx_out		)
	);

	//  -------------------------------------------------------------------------------------
	//	clkfxdv全局驱动
	//  -------------------------------------------------------------------------------------
	BUFGCE clkfxdv_buf (
	.I						(clkfxdv		),
	.CE						(locked			),
	.O						(clk_fxdv_out	)
	);


endmodule
