//-------------------------------------------------------------------------------------------------
//  -- 版权所有者   : 中国大恒（集团）有限公司北京图像视觉技术分公司, 2010 -2015.
//  -- 保密级别     ：绝密.
//  -- 部门         : 硬件部，FPGA工作组
//  -- 模块名       : ad_clock_unit
//  -- 设计者       : 邢海涛
//-------------------------------------------------------------------------------------------------
//
//  -- 版本记录 :
//
//  -- 作者         :| 修改日期				:|  修改说明
//-------------------------------------------------------------------------------------------------
//  -- 邢海涛       :| 2015/8/9 13:15:39	:|  初始版本
//-------------------------------------------------------------------------------------------------
//
//  -- 模块描述     :
//              1)  : ... ...
//
//              2)  : ... ...
//
//              3)  : ... ...
//
//-------------------------------------------------------------------------------------------------
//仿真单位/精度
`timescale 1ns/1ps
//-------------------------------------------------------------------------------------------------

module ad_clock_unit # (
	parameter	CLK_UNIT_VENDOR		= "xilinx"		//串行时钟器件，"xilinx" "lattice"
	)
	(
	input			cli			,
	output			clk			,
	output			clk_ser		,
	output			reset_ser
	);

	//	ref signals
	wire			cli_delay	;
	wire			lock	;

	//	ref ARCHITECTURE

	//	-------------------------------------------------------------------------------------
	//	tCLIDLY typ value is 5 ns
	//	-------------------------------------------------------------------------------------
	assign	#5 cli_delay		= cli;

	//	-------------------------------------------------------------------------------------
	//	高速时钟
	//	-------------------------------------------------------------------------------------
	generate
		if(CLK_UNIT_VENDOR=="xilinx") begin
			dcm_ad dcm_ad_inst (
			.clk_in		(cli_delay		),
			.dcm_reset	(1'b0			),
			.clk0_out	(clk			),
			.clk_fx_out	(clk_ser		),
			.locked		(lock			)
			);
			assign	reset_ser	= !lock;
		end
		else if(CLK_UNIT_VENDOR=="lattice") begin
			pll_ad pll_ad_inst (
			.CLKI	(cli	),
			.CLKOP	(clk_ser	),
			.CLKOS	(clk		),
			.LOCK	(lock		)
			);
			assign	reset_ser	= !lock;
		end
	endgenerate



endmodule
