//-------------------------------------------------------------------------------------------------
//  -- 版权所有者   : 中国大恒（集团）有限公司北京图像视觉技术分公司, 2010 -2015.
//  -- 保密级别     ：绝密.
//  -- 部门         : 硬件部，FPGA工作组
//  -- 模块名       : pixelformat_sel
//  -- 设计者       : 邢海涛
//-------------------------------------------------------------------------------------------------
//
//  -- 版本记录 :
//
//  -- 作者         :| 修改日期				:|  修改说明
//-------------------------------------------------------------------------------------------------
//  -- 邢海涛       :| 2014/12/5 14:17:37	:|  初始版本
//-------------------------------------------------------------------------------------------------
//
//  -- 模块描述     : 图像选择模块
//              1)  : MT9P031时，该模块没有起到作用，为了以后可扩展性设计，保留该模块
//
//              2)  : ... ...
//
//              3)  : ... ...
//
//-------------------------------------------------------------------------------------------------
//仿真单位/精度
`timescale 1ns/1ps
//-------------------------------------------------------------------------------------------------

module pixelformat_sel # (
	parameter				SENSOR_DAT_WIDTH	= 10	,	//sensor 数据宽度
	parameter				REG_WD				= 32		//寄存器位宽
	)
	(
	//Sensor输入信号
	input								clk				,	//像素时钟
	input								i_fval			,	//场信号
	input								i_lval			,	//行信号
	input	[SENSOR_DAT_WIDTH-1:0]		iv_pix_data		,	//图像数据
	//寄存器数据
	input	[REG_WD-1:0]				iv_pixel_format	,	//0x01080001:Mono8、0x01100003:Mono10、0x01080008:BayerGR8、0x0110000C:BayerGR10
	//图像输出
	output								o_fval			,	//场有效
	output								o_lval			,	//行有效
	output	[SENSOR_DAT_WIDTH-1:0]		ov_pix_data			//图像数据
	);

	//	ref signals



	//	ref ARCHITECTURE

	assign	o_fval		= i_fval;
	assign	o_lval		= i_lval;
	assign	ov_pix_data	= iv_pix_data;


endmodule