//-------------------------------------------------------------------------------------------------
//  -- 版权所有者   : 中国大恒（集团）有限公司北京图像视觉技术分公司, 2010 -2015.
//  -- 保密级别     ：绝密.
//  -- 部门         : 硬件部，FPGA工作组
//  -- 模块名       : circuit_dependent
//  -- 设计者       : 邢海涛
//-------------------------------------------------------------------------------------------------
//
//  -- 版本记录 :
//
//  -- 作者         :| 修改日期				:|  修改说明
//-------------------------------------------------------------------------------------------------
//  -- 邢海涛       :| 2014/12/17 16:06:25	:|  初始版本
//-------------------------------------------------------------------------------------------------
//
//  -- 模块描述     : 与电路状态相关，因为io板上的光耦和三极管会带来反向问题，在此模块中将反向的信号还原。
//						由于需要和U2兼容，只还原输入信号，不还原输出信号。
//              1)  : line0输入反向
//				2)  : line1输出反向
//              3)  : gpio输入不反向
//				4)  : gpio输出反向
//              3)  : ... ...
//
//-------------------------------------------------------------------------------------------------
//仿真单位/精度
`timescale 1ns/1ps
//-------------------------------------------------------------------------------------------------

module circuit_dependent (
	//连接到IO板的引脚
	input								i_optocoupler		,	//line0的输入信号
	input	[1:0]						iv_gpio				,	//line2 3 的输入信号
	//连接到io channel的后级模块
	output								o_optocoupler_in	,	//对 i_optocoupler 取反
	output	[1:0]						ov_gpio_in				//保持 iv_gpio
	);

	//	ref signals



	//	ref ARCHITECTURE
	//  -------------------------------------------------------------------------------------
	//	根据IO板的状态，line0输入需要反向。Line2 line3输入不反向。
	//  -------------------------------------------------------------------------------------
	assign	o_optocoupler_in	= !i_optocoupler;
	assign	ov_gpio_in			= iv_gpio;



endmodule
