//-------------------------------------------------------------------------------------------------
//  -- 版权所有者   : 中国大恒（集团）有限公司北京图像视觉技术分公司, 2010 -2015.
//  -- 保密级别     ：绝密.
//  -- 部门         : 硬件部，FPGA工作组
//  -- 模块名       : triggersource_sel
//  -- 设计者       : 邢海涛
//-------------------------------------------------------------------------------------------------
//
//  -- 版本记录 :
//
//  -- 作者         :| 修改日期				:|  修改说明
//-------------------------------------------------------------------------------------------------
//  -- 邢海涛       :| 2014/12/1 13:21:15	:|  初始版本
//-------------------------------------------------------------------------------------------------
//
//  -- 模块描述     :选择输入的信号
//              1)  : 从3个外触发选择一个触发源。不支持多触发源
//
//              2)  : 必须用时序电路，如果用逻辑电路，因为输入信号是多bit，会造成毛刺输出
//
//              3)  : 后面的模块是滤波模块，软触发信号不接入此模块，会在后面的模块中再次选择
//
//-------------------------------------------------------------------------------------------------
//仿真单位/精度
`timescale 1ns/1ps
//-------------------------------------------------------------------------------------------------

module triggersource_sel (
	//时钟
	input				clk					,	//时钟
	//寄存器输入
	input	[3:0]		iv_trigger_source	,	//选择输入源，0001-软触发，0010-line0，0100-line2，1000-line3
	//line输入信号
	input	[2:0]		iv_linein			,	//line输入信号
	output				o_linein				//经过触发源选择的信号，3路触发信号变为1个
	);

	//	ref signals
	reg			sel_result	= 1'b0;

	//	ref ARCHITECTURE
	//  -------------------------------------------------------------------------------------
	//	1.低bit优先
	//	2.软触发不参与选择
	//  -------------------------------------------------------------------------------------
	always @ (posedge clk) begin
		case(iv_trigger_source)
			4'b0010	: sel_result	<= iv_linein[0];
			4'b0100	: sel_result	<= iv_linein[1];
			4'b1000	: sel_result	<= iv_linein[2];
			default	: sel_result	<= 1'b0;
		endcase
	end

	assign	o_linein	= sel_result;



endmodule
